TP1/perf/siu.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    many:
      target: 'http://localhost:5555/many'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # En los primeros 5 minutos, tengo 70 alumnos
    - name: Ansiosos
      duration: 300
      arrivalCount: 70
    # En los siguientes 25 minutos, tengo 30 alumnos
    - name: Relajados
      duration: 1500
      arrivalCount: 30


scenarios:
  - name: inscripcion a materias
    flow:
      - get:
          # /iniciar_sesion
          url: '/work?n=10'
      - get:
          # /ver_materias_disponibles
          url: '/sync'
      - loop:
          # /inscripcion
          - get:
              url: '/work?n=15'
        # Ni 3, ni 5 (Basados en el promedio de Nico Paez: 3.84 materias por alumno)
        count: 4
      - get:
          # /cerrar_sesion
          url: '/ping'